In [42]:
import pandas as pd

In [161]:
# 1. concat_1~3 merge(상하방향)

df1=pd.read_csv('concat_1.csv')
df2=pd.read_csv('concat_2.csv')
df3=pd.read_csv('concat_3.csv')

# merge 활용하는 경우
df12=pd.merge(df1,df2,how='outer')
df123=pd.merge(df12,df3)

# concat 활용하는 경우
df123=pd.concat([df1,df2,df3])

In [152]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [193]:
df2

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [114]:
df3

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [89]:
# 2. how, axis 값 변경해 테스트

df12_0=pd.concat([df1,df2],axis=0)
df12_1=pd.concat([df1,df2],axis=1)

df12_mo=pd.merge(df1,df2,how='outer')
df12_mi=pd.merge(df1,df2,how='inner') # 내용 X

df12_co=pd.concat([df1,df2],join='inner') # 아래와 결과 동일
df12_ci=pd.concat([df1,df2],join='outer')

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [97]:
# 3. ignore_index 옵션 적용

df12_0=pd.concat([df1,df2],ignore_index=True)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7

In [277]:
# 4. merge/join 버전으로 각각 진행

# merge 버전
pd.merge(df12,df123,how='outer')

# join 버전

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [276]:
# 5. survey_ site/survey_visited파일에 대해 merge 연습 (left_on/right_on 연습)

site=pd.read_csv('survey_site.csv')
visit=pd.read_csv('survey_visited.csv')

pd.merge(site,visit,left_on='name',right_on='site')

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-1 -49.85 -128.57    622   DR-1  1927-02-10
2   DR-1 -49.85 -128.57    844   DR-1  1932-03-22
3   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
4   DR-3 -47.15 -126.72    735   DR-3  1930-01-12
5   DR-3 -47.15 -126.72    751   DR-3  1930-02-26
6   DR-3 -47.15 -126.72    752   DR-3         NaN
7  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

In [274]:
# 6. ppt 문제
#!!!!!!!!!!!!시간 겁~나게 많이 걸림!!!!!!!!!!!!!!!

ht=np.array([0,0,3,5,2,4,9,0,6,4,0,6,0,0])

cnt=0
for i in range(2,len(ht)-2):
    diff=ht[i]-ht[i-2:i+3]
    res=diff[diff>=1]
    if len(res)==4:
        cnt+=min(res)
cnt

6

In [272]:
# 6. ppt 문제

ht=[0,0,3,5,2,4,9,0,6,4,0,6,0,0] # 건물의 높이

cnt=0
for i in range(2,len(ht)-2):
    a=ht[i]-ht[i-2] # +-2 범위 내 층 차이 임시 저장 변수들
    b=ht[i]-ht[i-1]
    c=ht[i]-ht[i+1]
    d=ht[i]-ht[i+2]
    if a>0 and b>0 and c>0 and d>0:
        cnt+=min(a,b,c,d)
cnt

1.0714924999992945